-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: Aug 18, 2024 at 08:33 AM
-- Server version: 8.2.0
-- PHP Version: 8.2.13

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `itmes`
--

-- --------------------------------------------------------

--
-- Table structure for table `borrowing`
--

DROP TABLE IF EXISTS `borrowing`;
CREATE TABLE IF NOT EXISTS `borrowing` (
  `b_id` int NOT NULL AUTO_INCREMENT,
  `b_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `b_date` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `b_borower` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `b_return_p` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `b_agency` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `b_status` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `b_return` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`b_id`),
  KEY `b_name` (`b_name`),
  KEY `b_agency` (`b_agency`)
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `borrowing`
--

INSERT INTO `borrowing` (`b_id`, `b_name`, `b_date`, `b_borower`, `b_return_p`, `b_agency`, `b_status`, `b_return`) VALUES
(1, 'MCNXCV182696518', '2024-08-14T07:15', 'U002', 'U003', '1017', 'ST009', '2024-08-28 00:15:00'),
(2, 'MCNXCV182696518', '2024-08-14T07:36', 'U002', 'U003', '1017', 'ST009', '0000-00-00 00:00:00'),
(3, 'MCNXCV182725515', '2024-08-22T07:51', 'U002', 'U003', '1017', 'ST009', '0000-00-00 00:00:00'),
(4, 'MCNXCV18271251C', '2024-08-14T07:57', 'U002', 'U003', '1017', 'ST009', '2024-08-22 00:57:00'),
(5, '7753', '2024-08-15T07:59', 'U002', 'U003', '1017', 'ST009', '0000-00-00 00:00:00'),
(6, '7753', '2024-04-06 02:04:00', 'U002', 'U003', '1018', 'ST009', '2024-04-19 07:30:14'),
(7, '1564', '2024-08-15T07:59', 'U002', 'U003', '1017', 'ST009', '0000-00-00 00:00:00'),
(8, '1564', '2024-08-22T08:03', 'U002', '', '1017', 'ST009', '2024-08-14 17:00:00'),
(9, '51321', '2024-08-21T08:05', 'U002', '', '1017', 'ST002', NULL),
(10, '1564', '2024-09-05T12:17', 'U002', '', '1017', 'ST007', NULL),
(11, '7753', '2024-08-08T12:29', 'U002', '', '1017', 'ST007', NULL),
(12, 'MCNXCV182699516', '2024-08-02T12:30', 'U002', '', '1017', 'ST007', NULL),
(13, 'MCNXCV182706518', '2024-08-01T12:32', 'U002', '', '1017', 'ST007', NULL),
(14, 'MCNXCV182696518', '2024-07-15T12:32', 'U002', '', '1017', 'ST007', NULL),
(15, '089', '2024-08-13T13:20', 'U002', '', '1017', 'ST005', '2024-08-30 17:00:00'),
(41, 'MCNXCV182699516', '2024-08-09T21:40', 'U002', 'U003', '1017', 'ST009', '0000-00-00 00:00:00'),
(42, 'MCNXCV182706518', '2024-08-09T21:44', 'U002', 'U002', '1017', 'ST009', '0000-00-00 00:00:00'),
(43, 'MCNXCV182699516', '2024-08-09T21:48', 'U002', 'U003', '1017', 'ST009', '2024-08-09 14:48:00'),
(44, 'MCNXCV182699516', '2024-08-10T21:53', 'U002', 'U003', '1017', 'ST009', '0000-00-00 00:00:00'),
(45, 'MCNXCV182710511', '2024-08-13T07:15', 'U002', 'U003', '1017', 'ST009', '2024-08-27 00:15:00');

-- --------------------------------------------------------

--
-- Table structure for table `borroww`
--

DROP TABLE IF EXISTS `borroww`;
CREATE TABLE IF NOT EXISTS `borroww` (
  `BruID` int NOT NULL AUTO_INCREMENT,
  `Brufname` varchar(10) NOT NULL,
  `BruTypeE` varchar(5) NOT NULL,
  `Brunum` int NOT NULL,
  `BrudateB` date NOT NULL,
  `BrudateRe` date NOT NULL,
  `u_office` int NOT NULL,
  PRIMARY KEY (`BruID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Table structure for table `items_1`
--

DROP TABLE IF EXISTS `items_1`;
CREATE TABLE IF NOT EXISTS `items_1` (
  `ag_id` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `ag_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `ag_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `ag_status` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`ag_id`),
  KEY `ag_status` (`ag_status`),
  KEY `ag_type` (`ag_type`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `items_1`
--

INSERT INTO `items_1` (`ag_id`, `ag_type`, `ag_name`, `ag_status`) VALUES
('089', 'T002', NULL, 'ST005'),
('111111', 'T003', 'sc02', 'ST004'),
('123456', 'T003', 'sc01', 'ST004'),
('1564', 'T003', 'SC03', 'ST007'),
('51321', 'T003', NULL, 'ST002'),
('7753', 'T002', 'ph1', 'ST007'),
('7754', 'T002', 'pn2', 'ST001'),
('MCNXCV182696518', 'T001', 'NB01', 'ST007'),
('MCNXCV182699516', 'T001', 'NB02', 'ST007'),
('MCNXCV182706518', 'T001', 'NB03', 'ST007'),
('MCNXCV182710511', 'T001', 'NB04', 'ST001'),
('MCNXCV18271251C', 'T001', 'NB05', 'ST001'),
('MCNXCV18271451D', 'T001', 'NB06', 'ST001'),
('MCNXCV182725515', 'T001', 'NB07', 'ST001'),
('MCNXCV182729514', 'T001', 'NB08', 'ST004'),
('MCNXCV18273851C', 'T001', 'NB09', 'ST001'),
('MCNXCV18274651B', 'T001', 'NB10', 'ST001'),
('MCNXCV21409352A', 'T001', 'NB11', 'ST001'),
('MCNXCV214095523', 'T001', 'NB12', 'ST001'),
('MCNXCV214098528', 'T001', 'NB13', 'ST001'),
('MCNXCV21410252G', 'T001', 'NB14', 'ST001'),
('MCNXCV214103520', 'T001', 'NB15', 'ST001'),
('MCNXCV214107523', 'T001', 'NB16', 'ST001'),
('MCNXCV21410852B', 'T001', 'NB17', 'ST001'),
('MCNXCV214110524', 'T001', 'NB18', 'ST001'),
('MCNXCV21411152B', 'T001', 'NB19', 'ST001'),
('MCNXCV214112529', 'T001', 'NB20', 'ST001'),
('MCNXCV214113524', 'T001', 'NB21', 'ST001'),
('MCNXCV214114520', 'T001', 'NB22', 'ST001'),
('MCNXCV214115524', 'T001', 'NB23', 'ST001'),
('MCNXCV21411852C', 'T001', 'NB24', 'ST001'),
('MCNXCV21412152A', 'T001', 'NB25', 'ST001'),
('MCNXCV21412352A', 'T001', 'NB26', 'ST001'),
('MCNXCV214124529', 'T001', 'NB27', 'ST001'),
('MCNXCV214125526', 'T001', 'NB28', 'ST001'),
('MCNXCV214127528', 'T001', 'NB29', 'ST001'),
('MCNXCV21412852B', 'T001', 'NB30', 'ST001');

-- --------------------------------------------------------

--
-- Table structure for table `item_type`
--

DROP TABLE IF EXISTS `item_type`;
CREATE TABLE IF NOT EXISTS `item_type` (
  `type_id` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `type_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `type_description` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`type_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `item_type`
--

INSERT INTO `item_type` (`type_id`, `type_name`, `type_description`) VALUES
('T001', 'Notebook', ''),
('T002', 'phone', 'phone'),
('T003', 'screen', 'screen'),
('T004', 'อุปกรณ์', 'อุปกรณ์'),
('T005', 'เครื่องมือ', 'เครื่องมือ');

-- --------------------------------------------------------

--
-- Table structure for table `office`
--

DROP TABLE IF EXISTS `office`;
CREATE TABLE IF NOT EXISTS `office` (
  `number` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `Agency` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `User` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`number`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `office`
--

INSERT INTO `office` (`number`, `Agency`, `User`) VALUES
('1017', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1034'),
('1018', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1018'),
('1019', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1019'),
('1020', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1020'),
('1021', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1021'),
('1022', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1022'),
('1023', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1023'),
('1024', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1024'),
('1025', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1025'),
('1026', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1026'),
('1027', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1027'),
('1028', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1028'),
('1029', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1029'),
('1030', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1030'),
('1031', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1031'),
('1032', 'งานพยาบาลผู้ป่วยใน', 'ห้องพัก IPD ชั้น 10 ห้อง 1032'),
('1050', 'ฝ่ายการพยาบาล', 'ห้องเลขาฝ่ายการพยาบาล ชั้น 10 (นางสาวอุทัยวรรณ)'),
('1051', 'ฝ่ายการพยาบาล', 'ห้องเลขาฝ่ายการพยาบาล ชั้น 9'),
('1052', 'ฝ่ายการพยาบาล', 'ห้องเลขาฝ่ายการพยาบาล ชั้น 10 (นางสาวนุจนีย์)'),
('1053', 'ฝ่ายการพยาบาล', 'ห้องเลขาฝ่ายการพยาบาล ชั้น 10 (นางศศิธร ประวัง )'),
('1054', 'ฝ่ายการพยาบาล', 'ห้องเลขาฝ่ายการพยาบาล ชั้น 10'),
('1055', 'ฝ่ายการพยาบาล', 'ห้องนอนเวร พยาบาล ชั้น 10 A'),
('1403', 'ฝ่ายการพยาบาล', 'ห้องพัก IPD ชั้น 14ห้อง 1403'),
('1407', 'ฝ่ายการพยาบาล', 'ห้องพัก IPD ชั้น 14ห้อง 1407'),
('1408', 'ฝ่ายการพยาบาล', 'ห้องพัก IPD ชั้น 14ห้อง 1408'),
('1501', 'งานส่งเสิมสุขภาพชุมชน', 'ก่อนพบแพทย์ ส่งเสริม ชั้น1'),
('1502', 'งานส่งเสิมสุขภาพชุมชน', 'หลังพบแพทย์ ส่งเสริม ชั้น1'),
('1503', 'งานส่งเสิมสุขภาพชุมชน', 'ห้องตรวจ ส่งเสริม ชั้น1 ห้อง 3'),
('1504', 'งานส่งเสิมสุขภาพชุมชน', 'ห้องตรวจ ส่งเสริม ชั้น1 ห้อง 4'),
('1505', 'งานส่งเสิมสุขภาพชุมชน', 'ห้องตรวจ ส่งเสริม ชั้น1 ห้อง 5'),
('1601', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD ชั้น1 ห้อง 1'),
('1602', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD ชั้น1 ห้อง 2'),
('1603', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD ชั้น1 ห้อง 3'),
('1604', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD ชั้น1 ห้อง 4 เคาเตอร์พยาบาล หลังพบแพทย์'),
('1605', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD ชั้น1 ห้อง 5'),
('1606', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD ชั้น1 ห้อง 6'),
('1607', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD ชั้น1 ห้อง 7'),
('1608', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD ชั้น1 ห้อง 8'),
('1609', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD ชั้น1 ห้อง 9'),
('1610', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD ชั้น1 ห้อง 10'),
('1611', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD ชั้น1 ห้อง 11'),
('1612', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD ชั้น1 ห้อง 12'),
('1620', 'งานการพยาบาลผู้ป่วยนอก', 'หน้าห้องตรวจ 5'),
('1621', 'งานการพยาบาลผู้ป่วยนอก', 'เคาเตอร์พยาบาล หลังพบแพทย์'),
('1701', 'งานเคลม', 'นางสาวพิชญธิดา'),
('1702', 'งานเคลม', 'นายพุฒิพัฒน์ แก่งศิริ'),
('1703', 'งานเคลม', 'นางสาว สุมิตรา ขวัญไตรรงค์'),
('1704', 'งานเคลม', 'นางสาว ศิวะพร'),
('1705', 'งานเคลม', 'นางสาวพิชญาภา'),
('1706', 'งานเคลม', 'นางสาว ศุภลักษณ์'),
('1707', 'งานการเงินบัญชีและงบประมาณ', ''),
('1800', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'หน้าห้องตรวจคัดกรอง ER'),
('1801', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'ห้องตรวจ ER ชั้น1 ห้อง 1'),
('1802', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'ห้องตรวจ ER ชั้น1 ห้อง 2'),
('1803', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'ห้องตรวจ ER ชั้น1 ห้อง 3'),
('1804', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'ห้องพักแพทย์ ER'),
('1901', 'งานรังสีวิทยา', 'ห้องตรวจ untrasound X-ray ห้อง 1'),
('1902', 'งานรังสีวิทยา', 'ห้องตรวจ untrasound X-ray ห้อง 2'),
('1903', 'งานรังสีวิทยา', 'ห้องตรวจ untrasound X-ray ห้อง 3'),
('1904', 'งานรังสีวิทยา', 'ห้องตรวจ untrasound X-ray ห้อง 4'),
('1905', 'ห้องนอนเวร งานรังสีวิทยา ชั้น 1', 'ห้องนอนเวร งานรังสีวิทยา'),
('1906', 'ห้องนอนเวร งานรังสีวิทยา ชั้น 1', 'ห้องนอนเวร งานรังสีวิทยา'),
('2100', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Heart ชั้น2 ห้องหัวหน้าพยาบาล'),
('2101', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Heart ชั้น2 ห้อง 1'),
('2102', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Heart ชั้น2 ห้อง 2'),
('2110', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Heart ชั้น2 ห้อง 10'),
('2111', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Heart ชั้น2 ห้อง 11 / หัวหน้าพยาบาล'),
('2200', 'งานการพยาบาลผู้ป่วยนอก', 'เคาน์เตอร์ OPD MED (อายุรกรรม)'),
('2201', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Med ชั้น2 ห้อง 1'),
('2202', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Med ชั้น2 ห้อง 2'),
('2203', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Med ชั้น2 ห้อง 3'),
('2204', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Med ชั้น2 ห้อง 4'),
('2205', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Med ชั้น2 ห้อง 5'),
('2206', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Med ชั้น2 ห้อง 6'),
('2207', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Med ชั้น2 ห้อง 7'),
('2208', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Med ชั้น2 ห้อง 8'),
('2209', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Med ชั้น2 ห้อง 9'),
('2210', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Med ชั้น2 ห้อง 10'),
('2211', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Med ชั้น2 ห้อง 11'),
('2212', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Med ชั้น2 ห้อง 12'),
('2213', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ OPD Med ชั้น2 ห้อง 13'),
('2301', 'งานพยาธิวิทยา', 'ห้องนอนเวร Lab'),
('2302', 'งานพยาธิวิทยา', 'LAB F3'),
('2303', 'งานพยาธิวิทยา', 'LAB F3 Bacteria'),
('2304', 'งานพยาธิวิทยา', 'Blood Bank LAB F3'),
('2401', 'งานการพยาบาลสูตินารีเวชกรรม', 'ห้องตรวจ LR ชั้น4 ห้อง 1'),
('2402', 'งานการพยาบาลสูตินารีเวชกรรม', 'ห้องตรวจ LR ชั้น4 ห้อง 2'),
('2403', 'งานการพยาบาลสูตินารีเวชกรรม', 'ห้องพักแพทย์'),
('2404', 'งานการพยาบาลสูตินารีเวชกรรม', 'ห้องนอนเวร LR'),
('2409', 'ศูนย์ความเป็นเลิศทางการแพทย์ด้านโรคหัวใจและหลอดเลือด', 'ห้องสังเกตอาการ Cath Lab'),
('2411', 'งานสนับสนุนการบริการ', 'งานสนับสนุนทางการพยาบาล CSSD'),
('2412', 'งานสนับสนุนการบริการ', ''),
('2500', 'งานการพยาบาลสูตินารีเวชกรรม', 'หัวหน้า นรีเวช'),
('2504', 'งานการพยาบาลสูตินารีเวชกรรม', 'ห้องตรวจ นรีเวช ชั้น2 ห้อง 4'),
('2505', 'งานการพยาบาลสูตินารีเวชกรรม', 'ห้องตรวจ นรีเวช ชั้น2 ห้อง 5'),
('2601', 'งานกายภาพ', 'ห้องตรวจ กายภาพ ชั้น2 ห้อง 1'),
('2602', 'งานกายภาพ', 'ห้องตรวจ กายภาพ ชั้น2 ห้อง 2'),
('2603', 'งานกายภาพ', 'ห้องกิจกรรมบำบัด'),
('2604', 'งานกายภาพ', 'โซนทำหัตถการ'),
('2701', 'งานการพยาบาลกุมารเวชศาสตร์', 'ห้องตรวจ เด็กป่วย ชั้น2 ห้อง 1'),
('2702', 'งานการพยาบาลกุมารเวชศาสตร์', 'ห้องตรวจ เด็กป่วย ชั้น2 ห้อง 2'),
('2703', 'งานการพยาบาลกุมารเวชศาสตร์', 'ห้องตรวจ เด็กป่วย ชั้น2 ห้อง 3'),
('2704', 'งานการพยาบาลกุมารเวชศาสตร์', 'ห้องตรวจ เด็กป่วย ชั้น2 ห้อง 4'),
('2705', 'งานการพยาบาลกุมารเวชศาสตร์', 'ห้องตรวจ เด็กป่วย ชั้น2 ห้อง 5'),
('2706', 'งานการพยาบาลกุมารเวชศาสตร์', 'ห้องตรวจ เด็กป่วย ชั้น2 ห้อง 6'),
('2707', 'งานการพยาบาลกุมารเวชศาสตร์', 'ห้องตรวจ เด็กป่วย ชั้น2 ห้อง 7'),
('2708', 'งานการพยาบาลกุมารเวชศาสตร์', 'ห้องตรวจ เด็กป่วย ชั้น2 ห้อง 8'),
('2709', 'งานการพยาบาลกุมารเวชศาสตร์', 'ห้องตรวจ เด็กป่วย ชั้น2 ห้อง 9'),
('2710', 'งานการพยาบาลกุมารเวชศาสตร์', 'ห้องตรวจ เด็กป่วย ชั้น2 ห้อง 10'),
('2801', 'งานการเงินบัญชีและงบประมาณ', 'นางสาวเบญจวรรณ บุญธรรม'),
('2802', 'งานการเงินบัญชีและงบประมาณ', 'นางสาวเอมมิกา แลใจปา'),
('2803', 'งานการเงินบัญชีและงบประมาณ', 'นางสาวหทัยญณัฐ ใจโลกา'),
('2804', 'งานการเงินบัญชีและงบประมาณ', 'นางสาวนฤมล พูลผล'),
('2805', 'งานการเงินบัญชีและงบประมาณ', 'นายศิริวัฒน์ ปั้นรูป (เบ้น)'),
('2806', 'งานการเงินบัญชีและงบประมาณ', 'นางสาวขวัญฤดี ธรรมศิริ'),
('2807', 'งานการเงินบัญชีและงบประมาณ', 'การจัดทรัพย์สินและรายได้ (นางสาวอุบลรัตน์ ใจยะ)'),
('2808', 'งานการเงินบัญชีและงบประมาณ', 'การเงินบัญชีและงบประมาณ (นางสาวจุฑามาศ คงวัฒนา)'),
('2809', 'งานการเงินบัญชีและงบประมาณ', 'งานแผนและงบประมาณ (นายชินพงศ์ กันนา)'),
('2810', 'งานการเงินบัญชีและงบประมาณ', 'น.ส ชนานันท์ กองเมิ้ง'),
('2811', 'งานการเงินบัญชีและงบประมาณ', 'น.ส นิลุบล ขัติยศ'),
('2812', 'งานการเงินบัญชีและงบประมาณ', 'นางสาว พัชรี ดีเลิศ'),
('2820', 'งานบริหารทั่วไป', 'น.ส ธัญญรัตน์ แก้วศิริ'),
('2901', 'งานการแพทย์บูรณาการ', 'ห้องตรวจ แพทย์บูรณาการ ห้อง 1'),
('2903', 'งานการแพทย์บูรณาการ', 'ห้องตรวจ แพทย์บูรณาการ ห้อง 3'),
('3101', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ ศัลยกรรม ชั้น3 ห้อง 1'),
('3102', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ ศัลยกรรม ชั้น3 ห้อง 2'),
('3103', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ ศัลยกรรม ชั้น3 ห้อง 3'),
('3104', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ ศัลยกรรม ชั้น3 ห้อง 4'),
('3105', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ ศัลยกรรม ชั้น3 ห้อง 5'),
('3200', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องหัวหน้า กระดูกและข้อ'),
('3201', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ กระดูกและข้อ ชั้น3 ห้อง 1'),
('3202', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ กระดูกและข้อ ชั้น3 ห้อง 2'),
('3203', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ กระดูกและข้อ ชั้น3 ห้อง 3'),
('3204', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ กระดูกและข้อ ชั้น3 ห้อง 4'),
('3205', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ กระดูกและข้อ ชั้น3 ห้อง 5'),
('3206', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ กระดูกและข้อ ชั้น3 ห้อง 6'),
('3207', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ กระดูกและข้อ ชั้น3 ห้อง 7'),
('3208', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ กระดูกและข้อ ชั้น3 ห้อง 8'),
('3301', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ หู คอ จมูก ชั้น3 ห้อง 1'),
('3302', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ หู คอ จมูก ชั้น3 ห้อง 2'),
('3303', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ หู คอ จมูก ชั้น3 ห้อง 3'),
('3304', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ หู คอ จมูก ชั้น3 ห้อง 4'),
('3305', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจการได้ยิน'),
('3306', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจการได้ยิน'),
('3307', 'งานการพยาบาลผู้ป่วยนอก', 'เคาเตอร์พยาบาล หลังพบแพทย์ OPD ENT'),
('3400', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องหัวหน้าพยาบาล ตา'),
('3401', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ ตา ชั้น3 ห้อง 1'),
('3402', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ ตา ชั้น3 ห้อง 2'),
('3403', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ ตา ชั้น3 ห้อง 3'),
('3404', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ ตา ชั้น3 ห้อง 4'),
('3405', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ ตา ชั้น3 ห้อง 5'),
('3406', 'งานการพยาบาลผู้ป่วยนอก', 'ห้องตรวจ ตา ชั้น3 ห้อง 6'),
('3407', 'งานการพยาบาลผู้ป่วยนอก', 'เคาเตอร์พยาบาล หลังพบแพทย์'),
('3601', 'งานทรัพยากรบุคคล', 'น.ส สิริพร เงินอินต๊ะ'),
('3602', 'งานทรัพยากรบุคคล', 'น.ส ศิรินภา ราชลำ'),
('3603', 'งานทรัพยากรบุคคล', 'น.ส อุบลลักษณ์ ใจฟู'),
('3604', 'งานทรัพยากรบุคคล', 'น.ส นนทวรรณ แก้วศรี'),
('3605', 'งานทรัพยากรบุคคล', 'น.ส พัชรินทร์ บัวนาค'),
('3606', 'งานทรัพยากรบุคคล', ''),
('3607', 'งานทรัพยากรบุคคล', ''),
('4000', 'งานบริหารทั่วไป', 'ประชาสัมพันธ์'),
('4001', 'งานบริหารทั่วไป', 'ประชาสัมพันธ์'),
('4002', 'หัวหน้าฝ่ายการแพทย์', 'ศาสตราจารย์คลินิก พลตรี นายแพทย์อภิชัย ลีละสิริ'),
('4003', 'งานบริหารทั่วไป', 'งานศูนย์บริการ Family Service'),
('4004', 'ศูนย์การแพทย์', '(รองอธิการบดี)'),
('4005', 'หัวหน้าฝ่ายการพยาบาล', 'นางสาวประชิด ศราธพันธุ์ (หัวหน้าฝ่ายการพยาบาล)'),
('4006', 'งานพัฒนาคุณภาพองค์กร', 'รักษาการแทน หัวหน้างานพัฒนาคุณภาพองค์กร'),
('4007', 'งานบริหารทั่วไป', '(ผู้อำนวยการโรงพยาบาลศูนย์การแพทย์)'),
('4008', 'ศูนย์การแพทย์', '(รองผู้อำนวยการศูนย์การแพทย์)'),
('4009', 'ศูนย์การแพทย์', 'พี่ฝน นางสาวปวีณา ธนารัตน์'),
('4010', 'หัวหน้าฝ่ายบริหาร', 'นางสาวกัญหา หยุ่นตระกูล (หัวหน้าฝ่ายบริหาร)'),
('4011', 'งานอาคารสถานที่และเครื่องมือทางการแพทย์', 'นายจรรยวรรธ กุณทรนีรานันต์ (หัวหน้างานอาคารและสถานที่)'),
('4012', 'งานส่งเสริมสุขภาพชุมชน', 'นายแพทย์สมปรารถน์ หมั่นจิต'),
('4013', 'ศูนย์การแพทย์', 'งานประชาสัมพันธ์ พี่อิ๋ว'),
('4014', 'งานพัสดุ', 'นางสาวจิราพร บัวขำ (มิ้ว)'),
('4015', 'งานบริหารทั่วไป', 'นางสาวรสริน ทองอาญา (แป๋ว)'),
('4016', 'งานบริหารทั่วไป', 'นางสาวภัทรพร กัลยา (น้ำหวาน)'),
('4017', 'งานบริหารทั่วไป', 'นางสาววิภาวี ดวงสนิท'),
('4018', 'งานการเงินบัญชีและงบประมาณ', 'นางสาวสลีลา แก้วเลิศ (พี่กิ๊ฟ)'),
('4019', 'ฝ่ายการพยาบาล', 'นางวันทนีย์ นนท์พิพัฒน์ (ฝ่ายการพยาบาล)'),
('4020', 'งานบริหารทั่วไป', 'นางสาวอังค์วรา ศรีเหรา'),
('4021', 'งานการเงินบัญชีและงบประมาณ', 'นางสาวภาวิณี พันวงศ์ (พี่ฝ้าย)'),
('4022', 'รองผู้อำนวยการ', 'นางสาวกัลยา ทับเกร็ด'),
('4023', 'ศูนย์การแพทย์', 'นางสาว โชติกา รัตนพนาวงษ์'),
('4024', 'งานพัสดุ', 'นางชมัยพร ชัยนาท'),
('4025', 'งานการเงินบัญชีและงบประมาณ', 'นางสาวสิริกุล จันทรเพชร'),
('4026', 'หน่วยโภชนาการ', 'นางสาวนฤมล ชุมภูทอง'),
('4027', 'งานสนับสนุนการบริการ', 'นางเจริญศรี กันทะวงค์'),
('4028', 'งานทรัพยากรบุคคล', 'นางสาวนันทินี ศุภมงคล'),
('4029', 'งานทรัพยากรบุคคล', 'นางสาวศิรินทรา มณีกิจ'),
('4030', 'งานทรัพยากรบุคคล', 'นายกริชกาย อินยาศรี'),
('4031', 'งานอาคารสถานที่และเครื่องมือทางการแพทย์', 'นายพุฒิพงษ์ เบ็ญชา(โน๊ต)/นายธนพล รัตนาภรณ์(ที)'),
('4032', 'งานทรัพยากรบุคคล', 'นายสมพงศ์ แก้วสิทธิ์'),
('4033', 'งานทรัพยากรบุคคล', 'นางสาวนันทพร อุปเสน'),
('4034', 'งานพัสดุ', 'นางสาวสิริมนต์ ถาแก้ว'),
('4035', 'งานการเงินบัญชีและงบประมาณ', 'นางสาวธัญวรัตน์ ใจยะ'),
('4036', 'งานการเงินบัญชีและงบประมาณ', 'นางสาวฐาณิษฎา นากายามะ (บี)/นางสาวเอมมิกา แลใจปา'),
('4037', 'งานสนับสนุนการบริการ', 'งานสนับสนุนบริการ'),
('4038', 'งานทรัพยากรบุคคล', 'นายพิพัฒน์พงศ์ ไชยลังการ'),
('4039', 'งานบริหารทั่วไป', 'หน้าห้องประชุมใหญ่ชั้น4'),
('4040', 'งานพัฒนาคุณภาพองค์กร', 'นางสาวนฤมล เสนาธรรม (นักสังคมสงเคราะห์)'),
('4041', 'งานพัสดุ', 'นางสาววรรณพร อินทะเสน'),
('4042', 'งานพัสดุ', 'นางสาวศิริมล ธรรมรัตน์'),
('4043', 'งานพัสดุ', 'นางสาวชลิตา พุลอ่ำ'),
('4044', 'งานพัสดุ', 'นางสาวสริตา ธรรมสิทธิ์'),
('4045', 'งานพัสดุ', 'นางสาวปรียารัตน์ จีระประภา'),
('4046', 'งานการเงินบัญชีและงบประมาณ', 'น.ส.ศิริพร ดวงติ๊บ'),
('4047', 'งานการเงินบัญชีและงบประมาณ', 'นางสาว นันทัชพร บุญนาค'),
('4048', 'งานการเงินบัญชีและงบประมาณ', 'นางสาว กรรณิการ์ อุดทา'),
('4049', 'งานพัสดุ', 'นาย บุญญรักษ์ ช่างเขียน'),
('4050', 'งานเทคโนโลยีสารสนเทศ', 'นายทีปกร ปงลังกา'),
('4051', 'งานเทคโนโลยีสารสนเทศ', 'นายฐิรศิลป์ ผู้ภักดี'),
('4052', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 7 Ward A'),
('4053', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 7 Ward A'),
('4055', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 7 Ward B'),
('4056', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 7 Ward B'),
('4057', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 7 Ward B (โต๊ะหมอ)'),
('4058', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 8 Ward A'),
('4059', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 8 Ward A'),
('4060', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 8 Ward A'),
('4061', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 8 Ward B'),
('4062', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 8 Ward B'),
('4063', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 8 Ward B'),
('4064', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 9 Ward A'),
('4065', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 9 Ward A'),
('4066', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 9 Ward A (โต๊ะหมอ)'),
('4067', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 9 Ward B'),
('4068', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 9 Ward B'),
('4069', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 9 Ward B (โต๊ะหมอ)'),
('4070', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 10 Ward A'),
('4071', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 10 Ward A'),
('4072', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 10 Ward A (โต๊ะหมอ)'),
('4073', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 10 Ward B'),
('4074', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 10 Ward B'),
('4075', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 10 Ward B (โต๊ะหมอ)'),
('4076', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 11 Ward A'),
('4077', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 11 Ward A'),
('4078', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 11 Ward A (โต๊ะหมอ)'),
('4079', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 11 Ward B'),
('4080', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 11 Ward B'),
('4081', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 11 Ward B (โต๊ะหมอ)'),
('4082', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 12 Ward A'),
('4083', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 12 Ward A'),
('4084', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 12 Ward A(โต๊ะหมอ)'),
('4085', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 12 Ward B'),
('4086', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 12 Ward B'),
('4087', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 12 Ward B(โต๊ะหมอ)'),
('4088', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 13 Ward A'),
('4089', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 13 Ward A'),
('4090', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 13 Ward A(โต๊ะหมอ)'),
('4091', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 13 Ward B'),
('4092', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 13 Ward B'),
('4093', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 13 Ward B(โต๊ะหมอ)'),
('4094', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 14 Ward A'),
('4095', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 14 Ward A'),
('4096', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 14 Ward A'),
('4097', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 14 Ward B'),
('4098', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 14 Ward B'),
('4099', 'งานพยาบาลผู้ป่วยใน', 'งานพยาบาลผู้ป่วยใน ชั้น 14 Ward B(โต๊ะหมอ)'),
('4101', '', 'FAX'),
('4103', 'งานพยาธิวิทยา', 'พ.ญ.อุบลวัณณ์ จรูญเรืองฤทธิ์'),
('4104', 'งานการเงินบัญชีและงบประมาณ', 'งานการเงินและงบประมาณ'),
('4105', 'งานการเงินบัญชีและงบประมาณ', 'งานการเงินและงบประมาณ'),
('4106', 'งานการเงินบัญชีและงบประมาณ', 'งานการเงินและงบประมาณ'),
('4107', 'งานเภสัชกรรม', 'งานเภสัชกรรม'),
('4108', 'งานเภสัชกรรม', 'งานเภสัชกรรม'),
('4109', 'งานประสานสิทธิ์การแพทย์', 'นางสาวจิรนันท์ นวลใส'),
('4110', 'งานประสานสิทธิ์การแพทย์', 'งานประสานสิทธิ์การแพทย์'),
('4111', 'งานอาคารสถานที่', 'งานอาคารและสถานที่'),
('4112', 'งานประสานสิทธิ์การแพทย์', 'งานประสานสิทธิ์การแพทย์'),
('4113', 'งานพยาธิวิทยา', 'น.ส.ปานวดี เตจะวงค์'),
('4114', 'งานพยาธิวิทยา', 'LAB งานพยาธิวิทยา'),
('4115', 'งานพยาธิวิทยา', 'LAB งานพยาธิวิทยา'),
('4116', 'งานการพยาบาลผู้ป่วยนอก', '(หัวหน้างานการพยาบาลผู้ป่วยนอก) OPD GP'),
('4117', 'งานการพยาบาลผู้ป่วยนอก', 'เคาน์เตอร์ OPD GP'),
('4118', 'งานการพยาบาลผู้ป่วยนอก', 'เคาน์เตอร์ OPD GP (จิตเวช)'),
('4119', 'งานส่งเสริมสุขภาพชุมชน', 'น.ส.สิรินทร์พร ภู่ประเสริฐ'),
('4120', 'งานส่งเสริมสุขภาพชุมชน', 'เคาน์เตอร์ห้องตรวจสุขภาพ'),
('4121', 'งานเภสัชกรรม', 'เคาน์เตอร์ห้องยา ชั้น3'),
('4122', 'งานเภสัชกรรม', 'เคาน์เตอร์ห้องยา ชั้น3'),
('4123', 'งานประชาสัมพันธ์', 'นักวิชาการสาธารณสุข งานวัคซีน'),
('4124', 'งานพยาธิวิทยา', 'LAB งานพยาธิวิทยา (พยาธิกายวิภาค)'),
('4125', 'งานส่งเสริมสุขภาพชุมชน', 'ธนกฤต สิทธิภา (นักวิชาการสาธารณสุข)'),
('4126', 'งานการแพทย์บูรณาการ', 'เคาร์เตอร์งานการแพทย์บูรณาการ'),
('4127', 'งานกายภาพบำบัด', '(หัวหน้างานกายภาพบำบัด)'),
('4128', 'งานพยาธิวิทยา', 'LAB งานพยาธิวิทยา'),
('4129', 'งานรังสีวิทยา', 'ห้อง Control MRI'),
('4130', 'งานรังสีวิทยา', 'งานรังสีวิทยา'),
('4131', 'งานรังสีวิทยา', 'ห้อง Control CT Scan'),
('4132', 'งานรังสีวิทยา', 'งานรังสีวิทยา MRI'),
('4133', 'ศูนย์ไต', 'เคาร์เตอร์ศูนย์ไต'),
('4134', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'เคาน์เตอร์ ER'),
('4135', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', '( หัวหน้างานการพยาบาลผู้ป่วยอุบัติเหตุ และฉุกเฉิน)'),
('4136', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'เคาน์เตอร์ ER'),
('4137', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'เคาน์เตอร์ ER'),
('4138', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'เคาน์เตอร์ ER (คัดกรอง)'),
('4139', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'เคาน์เตอร์ การเงิน ER (คัดกรอง)'),
('4140', 'งานการพยาบาลผู้ป่วยหนัก', '(หัวหน้างานการพยาบาลผู้ป่วยหนัก)'),
('4141', 'งานการพยาบาลผู้ป่วยหนัก', 'เคาร์เตอร์พยาบาล CCU งานการพยาบาลผู้ป่วยหนัก'),
('4142', 'ศูนย์ความเป็นเลิศทางการแพทย์ด้านโรคหัวใจและหลอดเลือด', 'เคาร์เตอร์พยาบาล Catch Lab'),
('4143', 'ศูนย์ความเป็นเลิศทางการแพทย์ด้านโรคหัวใจและหลอดเลือด', 'ห้อง Control Catch Lab'),
('4144', 'งานการพยาบาลสูตินารีเวชกรรม', '(หัวหน้างานการพยาบาลสูตินรีเวชกรรม)'),
('4145', 'งานการพยาบาลผู้ป่วยนอก', 'เคาน์เตอร์ OPD ตา'),
('4146', 'งานการพยาบาลผู้ป่วยนอก', 'เคาน์เตอร์ OPD หัวใจ'),
('4147', 'งานการพยาบาลผู้ป่วยนอก', 'เคาน์เตอร์ OPD หู คอ จมูก'),
('4148', 'งานการพยาบาลสูตินารีเวชกรรม', 'เคาร์เตอร์พยาบาล LR'),
('4149', 'งานการพยาบาลสูตินารีเวชกรรม', 'ห้องคลอด'),
('4150', 'งานการพยาบาลผ่าตัด', 'นางสุกัลยา เขื่อนเพ็ชร์ (หัวหน้างานการพยาบาลผ่าตัดและวิสัญญี)'),
('4151', 'งานการพยาบาลผ่าตัด', 'Counter - ติดต่อสอบถามงานการพยาบาลผ่าตัดและวิสัญญี'),
('4152', 'งานพยาบาลวิสัญญี', '(หัวหน้างานดมยาและวิสัญญี)'),
('4153', 'งานพยาบาลวิสัญญี', 'งานการพยาบาลวิสัญญี'),
('4154', 'งานการพยาบาลผ่าตัด', 'Counter -งานการพยาบาลผ่าตัด'),
('4155', 'งานการพยาบาลสูตินารีเวชกรรม', 'เคาร์เตอร์พยาบาล นรีเวชกรรม'),
('4156', 'งานการพยาบาลผู้ป่วยนอก', 'งานการพยาบาล OPD EYE'),
('4157', 'งานการพยาบาลผู้ป่วยนอก', 'เคาน์เตอร์ OPD MED (อายุรกรรม)'),
('4158', 'งานพยาบาลผู้ป่วยใน', 'เคาร์เตอร์พยาบาล Nursery'),
('4159', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'เคาร์เตอร์พยาบาล ARI'),
('4160', 'ศูนย์ความเป็นเลิศทางการแพทย์ด้านโรคหัวใจและหลอดเลือด', 'ห้องหัวหน้าพยาบาล Catch Lab'),
('4161', 'งานการพยาบาลผู้ป่วยนอก', 'งานการพยาบาล Orthopedic'),
('4162', 'งานการพยาบาลผู้ป่วยนอก', 'เคาร์เตอร์พยาบาล Orthopedic'),
('4163', 'งานการพยาบาลผู้ป่วยนอก PEDIATRIC', 'เคาร์เตอร์พยาบาล คลินิกเด็กป่วย'),
('4164', 'งานการพยาบาลผู้ป่วยนอก', 'คลินิกเด็กดี'),
('4165', 'งานการพยาบาลผู้ป่วยหนัก', 'เคาร์เตอร์พยาบาล อายุรกรรม 1 ICU'),
('4166', 'งานการพยาบาลผู้ป่วยหนัก', 'เคาร์เตอร์พยาบาล อายุรกรรม 2 ICU'),
('4167', 'หน่วยส่องกล้องทางระบบทางเดินอาหาร', 'นางศิริพร รัตนเลิศ'),
('4168', 'งานการพยาบาลผู้ป่วยนอก', 'เคาร์เตอร์พยาบาล ศัลยกรรม'),
('4169', 'งานการพยาบาลผู้ป่วยนอก', 'เคาร์เตอร์พยาบาล ศัลยกรรม'),
('4170', 'งานเทคโนโลยีสารสนเทศ', 'นายพิทักษ์พงศ์ สุทธพันธ์'),
('4171', 'งานเทคโนโลยีสารสนเทศ', 'นายณัฐพงษ์ กันทะนิด'),
('4172', 'งานเทคโนโลยีสารสนเทศ', 'นางสาวกนกพร ปทุมจำปา'),
('4173', 'งานเทคโนโลยีสารสนเทศ', 'นายปาลิน จัตุรัส'),
('4174', 'งานเทคโนโลยีสารสนเทศ', 'นายนติพงษ์ ดงปาลี'),
('4175', 'งานเทคโนโลยีสารสนเทศ', 'ว่าที่ร้อยตรีกัปตัน สุขชญานันท์'),
('4176', 'งานเทคโนโลยีสารสนเทศ', 'นายคมกฤช นวลทิม'),
('4177', 'งานเทคโนโลยีสารสนเทศ', 'นายปรเมษฐ์ วงษารันต์'),
('4178', 'งานเทคโนโลยีสารสนเทศ', 'นางสาวทิภาพร วงศ์งาม'),
('4179', 'งานเทคโนโลยีสารสนเทศ', 'นายพีระพงศ์ เหง่าตระกูล'),
('4180', 'งานเทคโนโลยีสารสนเทศ', 'นายศุภสิน รุ้งดี'),
('4181', 'งานการเงินบัญชีและงบประมาณ', 'นางสาวอารีรัตน์ รัศมี (ปอง)'),
('4182', 'งานบริหารทั่วไป', 'นาย พงศ์ศักดิ์ ปัญญา'),
('4183', 'งานบริหารทั่วไป', 'นางสาวสุทธยาภรณ์ สอนมณี'),
('4184', 'งานบริหารทั่วไป', 'นางสาวสุวิกรานต์ จันทนะ'),
('4185', 'งานบริหารทั่วไป', 'น.ส.ธัญญาลักษณ์ แก้วนาติ๊บ'),
('4186', 'งานพัฒนาคุณภาพองค์กร', 'นางสาวเสาวลักษณ์ อุ่นนันกาศ'),
('4187', 'งานการเงินบัญชีและงบประมาณ', 'นางสาวอารีรัตน์ ทาแกง'),
('4188', 'งานทรัพยากรบุคคล', 'ธัญญรัตน์ สายะวัฒนะ'),
('4189', 'งานนิติเวช', 'นายปธิกร ดวงสนิท / นายวัฒนา บุญมากาศ (หนุ่ม/เดย์)'),
('4190', 'งานบริหารทั่วไป', 'นายณัฐพงศ์ ชูมี'),
('4191', 'งานเคลม', 'นายปิยะราช บุญโยง'),
('4192', 'งานพัสดุ', 'สำนักงานเครื่องมือแพทย์'),
('4193', 'งานพัสดุ', 'นางสาวพรทิวา เงินอุไร'),
('4194', 'งานพัสดุ', 'นางสาวสิริลักษณ์ ธะจิต'),
('4195', 'งานบริหารทั่วไป', 'นางสาวกริษฐ์นัชชา ชินวงค์'),
('4196', 'งานส่งเสิมสุขภาพชุมชน', 'นางสุวพัชญ์ สุวรรณมามูล'),
('4197', 'งานส่งเสิมสุขภาพชุมชน', 'เคาร์เตอร์ งานส่งเสิมสุขภาพชุมชน'),
('4198', 'งานประชาสัมพันธ์', 'คัดกรอง GP เวชระเบียน'),
('4199', 'งานประชาสัมพันธ์', 'งานประชาสัมพันธ์'),
('4200', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'ER (Red Zorn)'),
('4201', 'งานการพยาบาลผู้ป่วยนอก', 'OPD GP'),
('4202', 'งานกายภาพบำบัด', 'กายภาพ'),
('4203', 'งานการพยาบาลผู้ป่วยนอก', 'OPD EYE'),
('4204', 'งานการพยาบาลผู้ป่วยนอก', 'คลินิกเด็กดี'),
('4205', 'งานการพยาบาลผู้ป่วยนอก', 'OPD GYN'),
('4206', 'งานการพยาบาลผู้ป่วยนอก', 'OPD Heart'),
('4207', 'งานการพยาบาลผู้ป่วยนอก', 'OPD MED'),
('4208', 'งานการพยาบาลผู้ป่วยนอก', 'OPD ENT'),
('4209', 'งานการพยาบาลผู้ป่วยนอก', 'คลังยา'),
('4210', 'งานสนับสนุนการบริการ', 'cssd'),
('4211', 'งานการพยาบาลผู้ป่วยหนัก', 'ICU MED1'),
('4212', 'งานการพยาบาลผู้ป่วยใน', 'IPD 7A'),
('4213', 'งานพยาธิวิทยา', 'LAB งานพยาธิวิทยา'),
('4214', 'งานพยาธิวิทยา', 'Blood Bank F3'),
('4215', 'งานพยาธิวิทยา', 'LAB งานพยาธิวิทยา'),
('4216', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'ARI (ER)'),
('4217', 'งานบริหารทั่วไป', 'ห้องศูนย์วิทยุ ชั้น1'),
('4218', 'งานบริหารทั่วไป', 'สำนักงานชั้น4'),
('4219', 'งานประสานสิทธ์', 'เคาร์เตอร์ประสานสิทธ์'),
('4220', 'งานการเงินบัญชีและงบประมาณ', 'งานแผนและนโยบาย'),
('4221', 'งานอาคารสถานที่', 'อจ.ครรชิต จามีกรณ์'),
('4222', 'งานอาคารสถานที่', 'ห้อง Fire Commard'),
('4223', 'ศูนย์การแพทย์', 'นางสาววันวิสาข์ ปัญจขันธ์'),
('4224', 'ศูนย์การแพทย์', 'น.ส ธัญนันท์ บั้งเงิน'),
('4225', 'งานบริหารทั่วไป', 'น.ส ธัญญารัตน์ แก้วศิริ'),
('4227', 'งานพยาธิวิทยา', 'นางสาวนิชกานต์ พิมพ์วงศ์ทอง'),
('4228', 'งานพัสดุ', 'นางสาวดรุณี ปินคำ'),
('4229', 'งานพัสดุ', 'นางสาวโชติกา ขันสุธรรม'),
('4230', 'งานบริหารทั่วไป', 'นางสาวชติณัน วัณชัย'),
('4231', 'งานการพยาบาลผู้ป่วยใน', 'LR ชั้น4'),
('4232', 'งานการพยาบาลผู้ป่วยนอก', 'Check up'),
('4233', 'งานการเงินบัญชีและงบประมาณ', 'Cashier F14'),
('4234', 'งานบริหารทั่วไป', 'น.ส อาภิสรา จินดารักษ์'),
('4235', 'งานบริหารทั่วไป', 'น.ส สุพรรษา นวลบุญเรือง'),
('4236', 'งานการเงินบัญชีและงบประมาณ', 'Cashier F1'),
('4237', 'ส่งเสริมสุขภาพชุมชน', 'นางสาวจิตตราภรณ์ บุญดี'),
('4238', 'งานพัฒนาคุณภาพองค์กร', 'HA'),
('4239', 'งานนิติเวช', 'นิติเวช'),
('4240', 'งานการเงินบัญชีและงบประมาณ', 'นางสาว เนตรนภา โกแสนตอ Cashier F2'),
('4241', 'งานพัสดุ', 'นางสาว รัตติยาภรณ์ บุญชื่น'),
('4242', 'งานบริหารทั่วไป', 'ประชาสัมพันธ์ (เสาร์กลม)'),
('4243', 'งานการพยาบาลผู้ป่วยนอก', 'OPD PED ห้องแยกโรค'),
('4244', 'งานการพยาบาลผู้ป่วยนอก', 'คลินิคเด็กดี (ห้องพัฒนาการ)'),
('4245', 'งานพัสดุ', 'นางสาวขวัญฤดี วงค์กิติ'),
('4260', 'งานการพยาบาลผ่าตัด', 'งานพยาบาลผ่าตัด เคาร์เตอร์หน้า'),
('4261', 'งานการพยาบาลผู้ป่วยใน', 'เคาร์เตอร์ Nursery'),
('4262', 'งานการพยาบาลผู้ป่วยนอก', 'หัวหน้า OPD PED'),
('4263', 'งานการพยาบาลผู้ป่วยนอก', 'เคาร์เตอร์พยาบาล คลินิกเด็กป่วย'),
('4274', 'งานเทคโนโลยีสารสนเทศ', 'นางสาวเจนจิรา สังสัมฤทธิ์'),
('4290', 'งานบริหารทั่วไป', 'นาย ภรัณยู แกล้วกล้า'),
('4291', 'งานพัสดุ', 'น.ส ยุพิน หมั่นประทุม'),
('4292', 'งานพัสดุ', 'สำนักงานเครื่องมือแพทย์ (นายรุ่งโรจน์ ศรีธิเลิศ)'),
('4298', '', 'F13'),
('4299', 'งานประชาสัมพันธ์', 'โถงประชาสัมพันธ์'),
('4331', 'HA', 'สอน สแดงF13'),
('4333', 'งานอาคารสถานที่', 'ห้องประชุม ชั้น1'),
('4444', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'เวรเปล ER'),
('4445', 'งานการพยาบาลผู้ป่วยอุบัติเหตุและฉุกเฉิน', 'เวรเปล เวชระเบียน'),
('4664', 'งานเทคโนโลยีสารสนเทศ', 'งานโสตฯ'),
('4666', 'งานเทคโนโลยีสารสนเทศ', 'ห้องประชุม ชั้น6'),
('4888', 'งานเทคโนโลยีสารสนเทศ', 'ห้อง Fire Commard'),
('4899', 'งานเทคโนโลยีสารสนเทศ', 'ห้อง NOC'),
('4999', 'งานเทคโนโลยีสารสนเทศ', 'โต๊ะ รปภ'),
('5100', 'งานการพยาบาลผ่าตัด', 'ห้องทานข้าว ผ่าตัด'),
('5101', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 1'),
('5102', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 2'),
('5103', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 3'),
('5104', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 4'),
('5105', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 5'),
('5106', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 6'),
('5107', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 7'),
('5108', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 8'),
('5109', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 9'),
('5110', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 10'),
('5111', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 11'),
('5112', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 12'),
('5113', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 13'),
('5114', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 14'),
('5115', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 15'),
('5116', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 16'),
('5117', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 17'),
('5118', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 18'),
('5119', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 19'),
('5120', 'งานการพยาบาลผ่าตัด', 'ห้องผ่าตัด ชั้น5 ห้อง 20'),
('5121', 'งานพยาบาลวิสัญญี', 'วิสัญญี ANES'),
('5301', 'งานการพยาบาลผ่าตัด', 'ห้องนอนเวร งานการพยาบาลผ่าตัด'),
('5302', 'งานการพยาบาลผ่าตัด', 'ห้องนอนเวร งานการพยาบาลผ่าตัด'),
('5303', 'งานการพยาบาลผ่าตัด', 'ห้องนอนเวร งานการพยาบาลผ่าตัด'),
('5304', 'งานการพยาบาลผ่าตัด', 'ห้องเก็บเครื่องมือปราศจากเชื้อ'),
('6001', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 7 Ward A'),
('6002', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 7 Ward B'),
('6003', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 8 Ward A'),
('6004', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 8 Ward B'),
('6005', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 9 Ward A'),
('6006', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 9 Ward B'),
('6007', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 10 Ward A'),
('6008', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 10 Ward B'),
('6009', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 11 Ward A'),
('6010', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 11 Ward B'),
('6011', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 12 Ward A'),
('6012', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 12 Ward B'),
('6013', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 13 Ward A'),
('6014', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 13 Ward B'),
('6015', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 14 Ward A'),
('6016', 'งานพยาบาลผู้ป่วยใน', 'ห้องหัวหน้าพยาบาล งานพยาบาลผู้ป่วยใน ชั้น 14 Ward B'),
('7101', 'งานพยาบาลผู้ป่วยใน', 'ห้องตรวจ เคมีบำบัด'),
('7102', 'งานพยาบาลผู้ป่วยใน', 'ห้องยาเคมีบำบัด'),
('7771', 'งานเทคโนโลยีสารสนเทศ', 'นายณัฐกิตติ์ จันต๊ะนาเขต เน็ตตี้'),
('7777', 'งานเทคโนโลยีสารสนเทศ', 'นางสาวรมณีย์ ควงปาริชาต (พี่กล้วย)'),
('8888', 'งานเทคโนโลยีสารสนเทศ', 'Code ห้อง BAS');

-- --------------------------------------------------------

--
-- Table structure for table `statuslist`
--

DROP TABLE IF EXISTS `statuslist`;
CREATE TABLE IF NOT EXISTS `statuslist` (
  `st_id` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `st_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `st_des` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`st_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `statuslist`
--

INSERT INTO `statuslist` (`st_id`, `st_name`, `st_des`) VALUES
('ST001', 'พร้อมใช้งาน', 'พร้อมใช้งาน'),
('ST002', 'ยืม', 'ถูกยืม'),
('ST003', 'ชำรุจ', 'เสียหาย'),
('ST004', 'จำหน่าย', 'จำหน่าย'),
('ST005', 'รอครบกำหนดวันยืม', 'รอครบกำหนดวันยืม'),
('ST006', 'รอยืนยันคืน', 'รอยืนยันคืน'),
('ST007', 'รอยืนยันยืมใช้งาน', 'รอยืนยันยืมใช้งาน'),
('ST008', 'แจ้งคืนอุปกรณ์', 'แจ้งคืนอุปกรณ์'),
('ST009', 'คืนอุปกรณ์แล้ว', 'คืนอุปกรณ์แล้ว'),
('ST010', 'จอง', 'จองอุปกรณ์ยืมใช้งานต่อ');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
CREATE TABLE IF NOT EXISTS `users` (
  `u_id` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `u_fname` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `u_lname` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `u_email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `u_address` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `u_username` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `u_password` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `u_status_id` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`u_id`),
  KEY `fk_status` (`u_status_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`u_id`, `u_fname`, `u_lname`, `u_email`, `u_address`, `u_username`, `u_password`, `u_status_id`) VALUES
('U001', 'นพอัครพงษ์', 'ขัติยะ', 'iookef', '1017\r\n', 'admin', 'admin', '3'),
('U002', 'นพอัครพงษ์', 'ขัติยะ', 'iookef', '1017', 'admin', '123', '1'),
('U003', 'นพอัครพงษ์', 'ขัติยะ', 'iookef', '1017', 'adminit', '1234', '2'),
('U004', 'นาย ', 'จ', 'dae@g', '1020', 'aaaa', 'aaaa', '2');

-- --------------------------------------------------------

--
-- Table structure for table `u_status`
--

DROP TABLE IF EXISTS `u_status`;
CREATE TABLE IF NOT EXISTS `u_status` (
  `u_status_id` int NOT NULL AUTO_INCREMENT,
  `u_status_name` varchar(255) NOT NULL,
  PRIMARY KEY (`u_status_id`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `u_status`
--

INSERT INTO `u_status` (`u_status_id`, `u_status_name`) VALUES
(1, 'พนักงาน'),
(2, 'ช่างไอที'),
(3, 'แอดมิน'),
(4, 'หัวหน้าฝ่าย');

--
-- Constraints for dumped tables
--

--
-- Constraints for table `borrowing`
--
ALTER TABLE `borrowing`
  ADD CONSTRAINT `borrowing_ibfk_1` FOREIGN KEY (`b_name`) REFERENCES `items_1` (`ag_id`),
  ADD CONSTRAINT `borrowing_ibfk_2` FOREIGN KEY (`b_agency`) REFERENCES `office` (`number`);

--
-- Constraints for table `items_1`
--
ALTER TABLE `items_1`
  ADD CONSTRAINT `items_1_ibfk_1` FOREIGN KEY (`ag_status`) REFERENCES `statuslist` (`st_id`),
  ADD CONSTRAINT `items_1_ibfk_2` FOREIGN KEY (`ag_type`) REFERENCES `item_type` (`type_id`) ON DELETE RESTRICT ON UPDATE RESTRICT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
